#read  -verific
read_verilog ../example/verilog/Black_Parrot/pickled.v

# elaborate design hierarchy
hierarchy -check -top black_parrot


# the high-level stuff
proc; 
flatten; 
opt; fsm; opt; memory; opt;

# mapping to internal cell library
techmap; opt;
write_verilog ../example/verilog/Black_Parrot/Black_Parrot_sog.v
